New results (fft improve, gpu timings fix)
Field grid 32x32x32, local force grid 64x64x64, particles 1000000, time in ms
CPU: OpenMP (gcc-11) 16 threads
GPU: Vulkan API 1.1, GLSL Shading Language
|----------------+----------------+----------------+-------------+-----------------|
| Stage          | Apple M1 (CPU) | Apple M1 (GPU) | Ryzen 3700X | Nvidia RTX 3060 |
|----------------+----------------+----------------+-------------+-----------------|
| Density        |           9.63 |           5.36 |        6.01 |            1.36 |
| Poisson        |            1.7 |           1.21 |        1.26 |            0.37 |
| Field strenght |           0.83 |           0.01 |        0.73 |            0.04 |
| Local forces   |         159.20 |         103.06 |      123.91 |           31.55 |
| New positions  |           68.3 |           7.84 |      153.84 |            1.00 |
| Total          |         239.66 |         117.48 |      285.75 |           34.32 |
|----------------+----------------+----------------+-------------+-----------------|
#+TBLFM: @>$2=vsum(@2..@-1)::@>$3=vsum(@2..@-1)::@>$4=vsum(@2..@-1)::@>$5=vsum(@2..@-1)

Field grid 64x64x64, local force grid 64x64x64, particles 1000000, time in ms
CPU: OpenMP (gcc-11) 16 threads
GPU: Vulkan API 1.1, GLSL Shading Language
|----------------+----------------+----------------+-------------+-----------------|
| Stage          | Apple M1 (CPU) | Apple M1 (GPU) | Ryzen 3700X | Nvidia RTX 3060 |
|----------------+----------------+----------------+-------------+-----------------|
| Density        |           9.73 |          11.61 |        6.55 |            2.26 |
| Poisson        |           9.52 |           5.69 |        6.90 |            1.44 |
| Field strenght |           6.63 |           0.01 |        5.32 |            0.14 |
| Local forces   |          394.9 |         103.09 |      209.32 |           31.76 |
| New positions  |          93.45 |           8.38 |       212.8 |            1.41 |
| Total          |         514.23 |         128.78 |      440.89 |           37.01 |
|----------------+----------------+----------------+-------------+-----------------|
#+TBLFM: @>$2=vsum(@2..@-1)::@>$3=vsum(@2..@-1)::@>$4=vsum(@2..@-1)::@>$5=vsum(@2..@-1)

Field grid 128x128x128, no local force, particles 1000000, time in ms
CPU: OpenMP (gcc-11) 16 threads
GPU: Vulkan API 1.1, GLSL Shading Language
|----------------+----------------+----------------+-------------+-----------------|
| Stage          | Apple M1 (CPU) | Apple M1 (GPU) | Ryzen 3700X | Nvidia RTX 3060 |
|----------------+----------------+----------------+-------------+-----------------|
| Density        |          14.65 |          38.57 |       11.52 |            5.28 |
| Poisson        |          68.83 |          82.49 |       62.50 |           22.67 |
| Field strenght |          47.11 |           0.01 |       42.15 |            2.57 |
| New positions  |         133.63 |          12.37 |      242.97 |            1.93 |
| Total          |         264.22 |         133.44 |      359.14 |           32.45 |
|----------------+----------------+----------------+-------------+-----------------|
#+TBLFM: @>$2=vsum(@2..@-1)::@>$3=vsum(@2..@-1)::@>$4=vsum(@2..@-1)::@>$5=vsum(@2..@-1)

PM/PM^3, Nvidia, Total (Left: PM, Right PM^3)
|--------+--------+--------+--------+---------+---------+---------|
| N*10^6 |   n=32 |   n=64 |  n=128 | n=32    | n=64    | n=128   |
|--------+--------+--------+--------+---------+---------+---------|
|      2 |   5.68 |   9.44 |  36.44 | 90.99   | 98.77   | 136.20  |
|      4 |  10.02 |  15.75 |  44.91 | 331.23  | 339.77  | 375.96  |
|      8 |  18.37 |  29.47 |  60.21 | 1141.58 | 1172.94 | 1184.04 |
|     30 |  62.43 |  98.51 | 143.11 | -       | -       | -       |
|     40 |  80.02 | 126.70 | 180.65 | -       | -       | -       |
|    100 | 193.58 | 310.70 | 410.53 | -       | -       | -       |
|--------+--------+--------+--------+---------+---------+---------|

Old results
Field grid 128x128x128, local force grid 64x64x64, particles 1000000, time in ms
CPU: OpenMP (gcc-11) 16 threads
GPU: Vulkan API 1.1, GLSL Shading Language
|----------------+----------------+----------------+-------------+-----------------|
| Stage          | Apple M1 (CPU) | Apple M1 (GPU) | Ryzen 3700X | Nvidia RTX 3060 |
|----------------+----------------+----------------+-------------+-----------------|
| Density        |          14.80 |          25.08 |        8.26 |           14.59 |
| Poisson        |         118.88 |          12.49 |      219.96 |            7.42 |
| Field strenght |          45.99 |           2.19 |       43.22 |            3.78 |
| Local forces   |         324.36 |         249.00 |      209.14 |           22.18 |
| New postions   |         138.99 |           0.06 |      191.82 |            1.68 |
| Total          |         643.03 |         289.21 |      672.39 |           49.90 |
|----------------+----------------+----------------+-------------+-----------------|

Relative
|----------------+----------------+----------------+-------------+-----------------|
| Stage          | Apple M1 (CPU) | Apple M1 (GPU) | Ryzen 3700X | Nvidia RTX 3060 |
|----------------+----------------+----------------+-------------+-----------------|
| Density        |              1 |           0.59 |        1.79 |            1.01 |
| Poisson        |              1 |           9.52 |        0.54 |           16.02 |
| Field strenght |              1 |           21.0 |        1.06 |           12.16 |
| Local forces   |              1 |            1.3 |        1.55 |           14.62 |
| New postions   |              1 |         2316.5 |        0.72 |           82.73 |
| Total          |              1 |           2.22 |        0.96 |           12.88 |
|----------------+----------------+----------------+-------------+-----------------|

Field grid 256x256x256, without local forces, particles 1000000, time in ms
CPU: OpenMP (gcc-11) 16 threads
GPU: Vulkan API 1.1, GLSL Shading Language
|----------------+----------------+----------------+-------------+-----------------|
| Stage          | Apple M1 (CPU) | Apple M1 (GPU) | Ryzen 3700X | Nvidia RTX 3060 |
|----------------+----------------+----------------+-------------+-----------------|
| Density        |          36.31 |         107.89 |       30.32 |           69.50 |
| Poisson        |        1616.85 |         158.08 |     3416.26 |          122.11 |
| Field strenght |         376.80 |          62.18 |      344.99 |           33.07 |
| New postions   |         162.49 |           0.14 |      199.67 |            2.25 |
| Total          |        2217.83 |         328.36 |     4018.35 |          226.95 |
|----------------+----------------+----------------+-------------+-----------------|

Relative
|----------------+----------------+----------------+-------------+----------------|
| Stage          | Apple M1 (CPU) | Apple M1 (GPU) | Ryzen 3700X | Nvidia RTX3600 |
|----------------+----------------+----------------+-------------+----------------|
| Density        |              1 |           0.34 |        1.20 |           0.52 |
| Poisson        |              1 |          10.22 |        0.47 |          13.24 |
| Field strenght |              1 |           6.05 |        1.09 |          11.39 |
| New postions   |              1 |        1160.64 |        0.81 |          72.21 |
| Total          |              1 |           6.75 |        0.55 |           9.77 |
|----------------+----------------+----------------+-------------+----------------|

Referencies
1. R.Hockney, J.Eastwood, Computer Simulation Using Particles, McGraw-Hill, 1981,
   (перевод: Р.Хокни, Дж.Иствуд, Численное моделирование методом частиц, Москва, Мир, 1987)
   (PM and P3M algorithms)
2. A.A.Samarskii, E.S.Nikolaev, Numerical Methods For Grid Equations, Birkhauser Verlag, 1989
   (оригинал: А.А.Самарский, Е.С.Николаев, Методы решения сеточных уравнений, Москва, Наука, 1978)
   (Poisson solver)
3. L.Nyland, Fast N-Body simulation with CUDA, in GPU Gems 3, Addison Wesley Professional, 2007
   (Local-force solver)
